app/Controllers/Tasks.php

UPDATE `task` SET `description` = 'demozaid', `updated_at` = '2023-05-27 04:44:34'
WHERE `task`.`id` IN ('17')
---
    public function update($id)
	{
        $task = $this->getTaskOr404($id);

		$post = $this->request->getPost();
		unset($post['user_id']);

		$task->fill($post);

		if ( ! $task->hasChanged()) {

            return redirect()->back()
                             ->with('warning', 'Nothing to update')
                             ->withInput();
		}

        if ($this->model->save($task)) {