app/Models/UserModel.php

    public function findByEmail($email)
    {
        return $this->where('email', $email)
                    ->first();
---
SELECT *
FROM `user`
WHERE `email` = 'demo@ggfgfmail.com'
 LIMIT 1